lsapp/app/controllers/home_controller.rb

SELECT "deals".* FROM "deals"
SELECT "merchants".* FROM "merchants"
SELECT "purchasers".* FROM "purchasers"
SELECT "sales".* FROM "sales"
---
  def index
    if current_user
      @deals = Deal.all
      @merchants = Merchant.all
      @purchasers = Purchaser.all
      @sales = Sale.all